<a href="https://colab.research.google.com/github/priyanka16march/assigenment/blob/master/DAy1_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
emp = pd.read_csv("/content/employees (1).csv")
emp

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True                   NaN
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry     NaN  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [4]:
type(emp)

pandas.core.frame.DataFrame

In [7]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [8]:
emp.head()

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

In [9]:
emp.tail()

    First Name Gender  ... Senior Management                  Team
995      Henry    NaN  ...             False          Distribution
996    Phillip   Male  ...             False               Finance
997    Russell   Male  ...             False               Product
998      Larry   Male  ...             False  Business Development
999     Albert   Male  ...              True                 Sales

[5 rows x 8 columns]

In [11]:
emp.sample(5)   # random data

    First Name  Gender  Start Date  ... Bonus %  Senior Management             Team
272       Fred    Male   2/20/1980  ...  18.225              False          Product
474   Jonathan    Male   8/15/2002  ...  11.364              False      Engineering
40     Michael    Male  10/10/2008  ...   2.665               True     Distribution
82      Steven    Male   3/30/1980  ...   8.379               True  Client Services
124    Marilyn  Female  11/16/1983  ...   2.401               True          Product

[5 rows x 8 columns]

In [12]:
emp[["First Name","Gender"]].head

<bound method NDFrame.head of     First Name  Gender
0      Douglas    Male
1       Thomas    Male
2        Maria  Female
3        Jerry    Male
4        Larry    Male
..         ...     ...
995      Henry     NaN
996    Phillip    Male
997    Russell    Male
998      Larry    Male
999     Albert    Male

[1000 rows x 2 columns]>

In [13]:
emp.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [15]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])
emp['Last Login Time'] = pd.to_datetime(emp['Last Login Time'])
emp['Senior Management']= emp['Senior Management'].astype('bool')

In [16]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [17]:
## missing valus
emp.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login Time        0
Salary                 0
Bonus %                0
Senior Management      0
Team                  43
dtype: int64

In [18]:
emp['First Name'] = emp['First Name'].fillna("unknown")
emp['Gender'] = emp['Gender'].fillna("other")
emp['Team'] = emp['Team'].fillna("No Team")

In [21]:
emp.isnull().sum()

First Name           0
Gender               0
Start Date           0
Last Login Time      0
Salary               0
Bonus %              0
Senior Management    0
Team                 0
dtype: int64

In [22]:
 emp.dropna()   # delete all rows having null values

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True               No Team
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry   other  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [25]:
mean_salary = emp['Salary'].mean()
mean_salary = round(mean_salary,2)
mean_salary

90662.18

In [27]:
emp['Salary'] = emp['Salary'].fillna(mean_salary)

In [28]:
emp.dropna(subset=["First Name"])

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True               No Team
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry   other  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [29]:
# drop cols and rows

In [30]:
new_emp = emp.drop(["First Name","Bonus %"],axis = 1)  # deletion of cols means axis = 1
new_emp

     Gender Start Date  ... Senior Management                  Team
0      Male 1993-08-06  ...              True             Marketing
1      Male 1996-03-31  ...              True               No Team
2    Female 1993-04-23  ...             False               Finance
3      Male 2005-03-04  ...              True               Finance
4      Male 1998-01-24  ...              True       Client Services
..      ...        ...  ...               ...                   ...
995   other 2014-11-23  ...             False          Distribution
996    Male 1984-01-31  ...             False               Finance
997    Male 2013-05-20  ...             False               Product
998    Male 2013-04-20  ...             False  Business Development
999    Male 2012-05-15  ...              True                 Sales

[1000 rows x 6 columns]

In [31]:
new_emp = emp.drop([2,4],axis = 0) ## deletion of rows  , axis = 0
new_emp

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True               No Team
3        Jerry    Male  ...              True               Finance
5       Dennis    Male  ...             False                 Legal
6         Ruby  Female  ...              True               Product
..         ...     ...  ...               ...                   ...
995      Henry   other  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[998 rows x 8 columns]

In [32]:
# filter data

In [35]:
emp[emp['Gender'] == "Male"]

    First Name Gender  ... Senior Management                  Team
0      Douglas   Male  ...              True             Marketing
1       Thomas   Male  ...              True               No Team
3        Jerry   Male  ...              True               Finance
4        Larry   Male  ...              True       Client Services
5       Dennis   Male  ...             False                 Legal
..         ...    ...  ...               ...                   ...
994     George   Male  ...              True             Marketing
996    Phillip   Male  ...             False               Finance
997    Russell   Male  ...             False               Product
998      Larry   Male  ...             False  Business Development
999     Albert   Male  ...              True                 Sales

[424 rows x 8 columns]

In [36]:
emp[emp['Salary']>=12000]

    First Name  Gender  ... Senior Management                  Team
0      Douglas    Male  ...              True             Marketing
1       Thomas    Male  ...              True               No Team
2        Maria  Female  ...             False               Finance
3        Jerry    Male  ...              True               Finance
4        Larry    Male  ...              True       Client Services
..         ...     ...  ...               ...                   ...
995      Henry   other  ...             False          Distribution
996    Phillip    Male  ...             False               Finance
997    Russell    Male  ...             False               Product
998      Larry    Male  ...             False  Business Development
999     Albert    Male  ...              True                 Sales

[1000 rows x 8 columns]

In [39]:
mask = emp['Gender'] == "Male"
mask1 = emp['Salary'] >= 120000
emp[(mask) & (mask1)]

    First Name Gender  ... Senior Management                  Team
3        Jerry   Male  ...              True               Finance
23     unknown   Male  ...              True               No Team
28       Terry   Male  ...              True       Client Services
32     unknown   Male  ...              True               No Team
39     unknown   Male  ...              True       Client Services
..         ...    ...  ...               ...                   ...
973    Russell   Male  ...             False  Business Development
979     Ernest   Male  ...              True               Product
981      James   Male  ...             False                 Legal
983       John   Male  ...             False           Engineering
999     Albert   Male  ...              True                 Sales

[107 rows x 8 columns]

In [41]:
# sorting od data

In [43]:
emp.sort_values("Salary")

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
576    Michael    Male 1993-07-30  ...  14.879              False          Product
238      Kevin    Male 1982-03-25  ...   5.128              False            Legal
82      Steven    Male 1980-03-30  ...   8.379               True  Client Services
63     Matthew    Male 2013-01-02  ...  18.040              False  Human Resources
650    Cynthia  Female 1986-07-05  ...  11.749              False          Finance
..         ...     ...        ...  ...     ...                ...              ...
160      Kathy  Female 2000-03-18  ...  16.991               True          Finance
186    unknown  Female 2005-02-23  ...   1.825               True            Sales
828    Cynthia  Female 2006-07-12  ...   7.864              False          Product
429       Rose  Female 2015-05-28  ...   5.630              False  Human Resources
644  Katherine  Female 1996-08-13  ...  18.912              False          Finance

[1000 rows x 8 columns]

In [45]:
newemp = emp.sort_values("Salary", ascending =False)
newemp

    First Name  Gender Start Date  ... Bonus %  Senior Management             Team
644  Katherine  Female 1996-08-13  ...  18.912              False          Finance
429       Rose  Female 2015-05-28  ...   5.630              False  Human Resources
828    Cynthia  Female 2006-07-12  ...   7.864              False          Product
186    unknown  Female 2005-02-23  ...   1.825               True            Sales
160      Kathy  Female 2000-03-18  ...  16.991               True          Finance
..         ...     ...        ...  ...     ...                ...              ...
650    Cynthia  Female 1986-07-05  ...  11.749              False          Finance
63     Matthew    Male 2013-01-02  ...  18.040              False  Human Resources
82      Steven    Male 1980-03-30  ...   8.379               True  Client Services
238      Kevin    Male 1982-03-25  ...   5.128              False            Legal
576    Michael    Male 1993-07-30  ...  14.879              False          Product

[1000 rows x 8 columns]

In [49]:
newemp = newemp.reset_index()

In [50]:
newemp

     level_0  index First Name  ... Bonus % Senior Management             Team
0          0    644  Katherine  ...  18.912             False          Finance
1          1    429       Rose  ...   5.630             False  Human Resources
2          2    828    Cynthia  ...   7.864             False          Product
3          3    186    unknown  ...   1.825              True            Sales
4          4    160      Kathy  ...  16.991              True          Finance
..       ...    ...        ...  ...     ...               ...              ...
995      995    650    Cynthia  ...  11.749             False          Finance
996      996     63    Matthew  ...  18.040             False  Human Resources
997      997     82     Steven  ...   8.379              True  Client Services
998      998    238      Kevin  ...   5.128             False            Legal
999      999    576    Michael  ...  14.879             False          Product

[1000 rows x 10 columns]

In [53]:
emp1 = emp.groupby("Gender")["Salary","Bonus %"].sum()
emp1

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

          Salary   Bonus %
Gender
Female  38800311  4306.127
Male    38660604  4392.570
other   13201266  1508.858

In [55]:
emp2 = emp.groupby("Team")["Salary","Bonus %"].sum()
emp1

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

          Salary   Bonus %
Gender
Female  38800311  4306.127
Male    38660604  4392.570
other   13201266  1508.858

In [58]:
emp2.iloc[1]  ## gives index value

Salary     9351789.000
Bonus %       1112.481
Name: Client Services, dtype: float64

In [59]:
emp2.loc["Client Services"]  ## loc gives location values

Salary     9351789.000
Bonus %       1112.481
Name: Client Services, dtype: float64

In [61]:
emp = emp.rename(columns ={"First Name": "Name"})
emp.head()

      Name  Gender Start Date  ... Bonus %  Senior Management             Team
0  Douglas    Male 1993-08-06  ...   6.945               True        Marketing
1   Thomas    Male 1996-03-31  ...   4.170               True          No Team
2    Maria  Female 1993-04-23  ...  11.858              False          Finance
3    Jerry    Male 2005-03-04  ...   9.340               True          Finance
4    Larry    Male 1998-01-24  ...   1.389               True  Client Services

[5 rows x 8 columns]